WcfHarness/WcfHarness/RequestXmls/DeleteRole_HardDelete.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteRole xmlns="http://www.tavisca.com/Vexiere/IRole/2013/01">
      <deleteRoleRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:IsHardDelete>true</a:IsHardDelete>
        <a:RoleIdentifier i:type="a:IdBasedRoleIdentifier">
          <a:Id>0</a:Id>
        </a:RoleIdentifier>
      </deleteRoleRequest>
    </DeleteRole>
  </s:Body>
</s:Envelope>